---
kind: property
id: P:Autodesk.Revit.DB.ElementId.Value
source: html/6f216e39-b66d-5df5-c60c-b9aaccb1e28a.htm
---
# Autodesk.Revit.DB.ElementId.Value Property

Provides the value of the element id as a 64-bit integer.

## Syntax (C#)
```csharp
public long Value { get; }
```